[{
  "_id": {
    "$oid": "659a4ddb19d4533cc78b2fff"
  },
  "bookTitle": "Jannat Kay Pattay",
  "authorName": "Nemrah Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1373050509i/18163929.jpg",
  "category": "Novel",
  "bookDescription": "The life of LLB (Hons) student Haya Suleman took an interesting turn when she received scholarship to study a five-month semester at a university in Turkey, but the circumstances became grave when someone leaked a private video of her made at a party on the internet. To keep the video away from the eyes of the members of her traditional family and to avoid any complications, she had to contact an officer of the Cyber Crime Cell who could have had her video removed. But soon she was unsettled by the fact that this faceless officer already knew so much about her.\nWill Haya be able to get that video removed from the internet? Will she be able to go to Turkey? And more importantly, will she finally be able to meet \"him\", him who she has never met before but has been searching for for many years?\nFrom the streets of Istanbul to the Bosporus sea, from the caves of Cappadocia to the torture cells in Indian jails, Jannat Kay Pattay (English: Leaves of Heaven) is like a roller coaster ride in which most of your guesses will be proved wrong and this mysterious story will keep its secrets safe till the last sentence. Because keeping secrets is an art and not everyone knows it!\n\nIt was first published in Shuaa Digest from March 2012 to May 2013.",
  "bookPDFURL": "https://drive.google.com/file/d/1SHbnZu1pMruTbHSh2okeQB5Q7t9BzN8S/view",
  "Price": "50"
},
{
  "_id": {
    "$oid": "659a4e7b19d4533cc78b3000"
  },
  "bookTitle": "Aab-e-Hayat",
  "authorName": "Umera Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1420365972i/23486520.jpg",
  "category": "Fiction",
  "bookDescription": "\"Aab-e-Hayat\" is a novel written by Pakistani author Umera Ahmed. The title, translated as \"Water of Life,\" is symbolic and reflects the themes of spiritual awakening, redemption, and the continuous flow of life. The novel is a sequel to Umera Ahmed's earlier work, \"Peer-e-Kamil,\" and continues the story of its central characters, Imama Hashim and Salaar Sikander.\n\nThe narrative of \"Aab-e-Hayat\" is richly layered, exploring complex human emotions, relationships, and the profound impact of spirituality on individuals. The story spans continents, taking readers on a journey from Pakistan to Turkey and the United States, as the characters grapple with their personal struggles and search for deeper meanings in life.\n\nThe novel delves into the challenges faced by the protagonists, testing their faith, resilience, and commitment to their beliefs. It weaves together elements of love, sacrifice, and the pursuit of self-discovery against a backdrop of contemporary societal issues. Umera Ahmed skillfully incorporates philosophical and spiritual dimensions, making \"Aab-e-Hayat\" more than just a love story, but a profound exploration of the human spirit.",
  "bookPDFURL": "https://drive.google.com/file/d/15Vl6Df8GO8Gi3woPG-gOMxLQ-B_fkLaw/view",
  "Price": "45"
},
{
  "_id": {
    "$oid": "659a4f2419d4533cc78b3001"
  },
  "bookTitle": "Namal",
  "authorName": "Nemrah Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1483526434i/22673665.jpg",
  "category": "Novel",
  "bookDescription": "Namal - one of the most awaited Urdu Novel is finally completed. Namal is a blockbuster Urdu masterpiece of Ms. Nimra Ahmed. Namal is an Urdu novel written by Nimra Ahmed. The writer of this book Ms. Nimra Ahmed is the 2nd most selling female author after Umera Ahmed. Nimra Ahmed has previously written more Urdu novels that were gone viral. Namal Urdu novel was also published in an Urdu Digest in parts/episodes which are recently completed and transcribed into a book. Namal Urdu Novel is the story of goodness and badness. Nimra Ahmed began writing this story in 2006. The story is inspired by the famous Shahzeb Khan and NAB officer Kamran Faisal murder cases. Both were killed by the elite classes, but no one got justice from the Judicial system of Pakistan. Nimra Ahmed has spotlighted such a differences of the Judicial system for the lower class as well as for the upper-class families. The purpose of this novel is to make people feel the badness and goodness. Namal Novel is the longest Urdu novel of Nimra Ahmed. The book is divided into the 30 segments. Nimra Ahmed's novel Namal has the following thirty stories;",
  "bookPDFURL": "https://drive.google.com/open?id=1FI96lR1VBZPYtkmd0g5_E8OhEM_CpJI7&authuser=0",
  "Price": "90"
},
{
  "_id": {
    "$oid": "659a503019d4533cc78b3002"
  },
  "bookTitle": "Peer-e-Kamil",
  "authorName": "Umera Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1441831053i/3260388.jpg",
  "category": "Fiction",
  "bookDescription": "Peer-e-Kamil (English: The Perfect Mentor) is a story focusing on a deviational sect which violates the finality of our Prophet (P.B.U.H) meanwhile, narrating a heart wrenching journey of two unhappy souls; Salaar Sikandar, a genius with an outstanding I.Q who has complicated queries about life and Imama Hashim, an ordinary girl with a stable family. Both are poles apart in terms of spiritual awakening. Destiny maneuvers their lives to cross each other’s paths, until Salaar falls in love with Imama after facing a horrifying experience that totally changes the course of his life.\nIt was published in Shuaa Digest from July 2003 to February 2004.",
  "bookPDFURL": "https://drive.google.com/file/d/1-YN5_55aLuxrF5_aqmcfXF93lwco_Vqo/view",
  "Price": "55"
},
{
  "_id": {
    "$oid": "659a51c519d4533cc78b3003"
  },
  "bookTitle": "Mushaf ",
  "authorName": "Nemrah Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1467368538i/13496093.jpg",
  "category": "Novel",
  "bookDescription": "\"Mushaf\" is a novel written by Pakistani author Nimra Ahmed. The novel is a gripping and emotional tale that revolves around the complexities of human relationships, spirituality, and the power of faith. The word \"Mushaf\" refers to a physical copy of the Quran, the holy book of Islam, and plays a significant role in the narrative.\n\nThe story follows the life of the protagonist, Mehak, a young and intelligent girl who finds solace in her deep connection with the Quran. Mehak discovers a Mushaf with handwritten notes, comments, and reflections that reveal the struggles and challenges faced by the previous owner. This discovery sets off a series of events that intertwine the lives of different characters, each dealing with their own trials and tribulations.\n\nAs the narrative unfolds, the novel explores themes of love, sacrifice, redemption, and the profound impact of spirituality on one's life. The characters grapple with their personal demons, and the novel beautifully delves into the emotional and psychological depths of their journeys.",
  "bookPDFURL": "https://drive.google.com/file/d/11qg0VMTT1pMhF7__r8q_ZhVZI8TLt-Np/view",
  "Price": "30"
},
{
  "_id": {
    "$oid": "659ac68da9865502f7be2df0"
  },
  "bookTitle": "Usri Yusra",
  "authorName": "Husna hussain",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664645478i/59967332.jpg",
  "category": "Religion and spirituality",
  "bookDescription": "In this novel, the writer has highlighted many social and moral issues In which he has told the story of two such characters who were disowned by their families, This story is based on two characters who are discounted by their family and hurt., And later they get only pain and rejection from their married life as well. And finally, fate brought them together in such a way that they themselves did not understand what happened to them and this., And this relationship became a forced relationship, And later there were revelations that made their relationship stronger And turned their hearts to each other…",
  "bookPDFURL": "https://drive.google.com/uc?export=download&id=1AHnGUlv9s3o-VHWhlbdhSVQ3QXjwk2vI",
  "Price": "100"
},
{
  "_id": {
    "$oid": "659ac75ea9865502f7be2df1"
  },
  "bookTitle": "Yaaram",
  "authorName": "Sumaira Hameed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1467593830i/25637197.jpg",
  "category": "Novel",
  "bookDescription": "Yaaram (English: My Beloved) is a tale of blind, selfless and unconditional love, friendship, devotion and loyalty.\nAmarha, hailing from Pakistan is accepted into Manchester University. There she meets Aliyan, a British Muslim who is the center of everybody's attention. Both are broken souls, bearers of terrible burdens but when they meet, their fates are forever intertwined.\nIt was first published in Shuaa Digest: July 2014-March 2015.\nThe story revolves around the lives of three main characters, Ahmer, Hira, and Saad. Ahmer is a young and ambitious man who aspires to become successful in his career. Hira is a confident and independent woman with her own dreams and aspirations. Saad, on the other hand, is Ahmer's friend and plays a significant role in the narrative.\n\nThe plot explores the complexities of relationships, friendship, and love. It delves into the challenges and hurdles that the characters face in their personal and professional lives. As the story unfolds, it weaves together elements of humor, romance, and drama, making it an engaging read for fans of the genre.",
  "bookPDFURL": "https://drive.google.com/file/d/1CRU7uXvhqsj3Mmpx3BK97ouVmU1dbIfU/view",
  "Price": "75"
},
{
  "_id": {
    "$oid": "659ac90da9865502f7be2df2"
  },
  "bookTitle": "Aag Ka Darya",
  "authorName": "Qurat Ul Aaen Haider",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1697908901i/146894696.jpg",
  "category": "Religion and spirituality",
  "bookDescription": "\"Aag Ka Darya,\" also known as \"River of Fire,\" is a classic Urdu novel written by Qurratulain Hyder, one of the most prominent and influential Urdu-language writers of the 20th century. The novel was first published in 1959 and is considered a landmark in Urdu literature.\n\nThe title \"Aag Ka Darya\" translates to \"River of Fire,\" which symbolizes the continuous flow of time and the unending cycles of history. The novel spans over two millennia, beginning from ancient civilizations and civilizations along the River Oxus (now Amu Darya) to the partition of India in 1947. The narrative is complex and multi-layered, intertwining various historical events and characters.\n\nThe novel is divided into four parts, each set in a different time period: the pre-Islamic era, the medieval period, the British colonial era, and the post-independence era. It explores the lives and experiences of different characters who are connected through the river of time. The characters include rulers, scholars, poets, and common people, providing a panoramic view of the socio-political and cultural landscape of the Indian subcontinent.",
  "bookPDFURL": "https://drive.google.com/file/d/1lv0XxoGhEadLDSQlw7MtoqFrDZ6stfnt/view?usp=sharing",
  "Price": "60"
},
{
  "_id": {
    "$oid": "659aca24a9865502f7be2df3"
  },
  "bookTitle": "Raja Gidh ",
  "authorName": "Bano Qudsia",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1340797512i/9632002.jpg",
  "category": "Novel",
  "bookDescription": "Raja Gidh (Urdu: راجه گدھ) by Bano Qudsia is one of the most widely read and acclaimed Urdu novels. Gidh is the Urdu word for a vulture and Raja is a Hindi synonym for king. The name anticipates the kingdom of vultures. In fact, parallel to the main plot of the novel, an allegorical story of such a kingdom is narrated. The metaphor of the vulture as an animal feeding mostly on the carcasses of dead animals is employed to portray the trespassing of ethical limits imposed by the society or by the religion.\n\nBano Qudsia has written this novel drawing on the religious concept of Haraam and Halaal. Many readers tend to interpret Raja Gidh as a sermon, in which Bano Qudsia puts forth her theory of hereditary transmission of Haraam genes. Naturally the plot is woven to support the thesis. In the opinion of many readers and critics she manages to convince them that the pursuance of Haraam, be it financial, moral or emotional, results in the deterioration of a person's normality in some sense. She seems to suggest that the abnormality is transferred genetically to the next generation.\n\nApart from the above implication the novel has many social, emotional and psychological aspects. The nostalgic narration of the historical Government College Lahore and of the Lawrence Garden Lahore lights upon the days of seventies and eighties.",
  "bookPDFURL": "https://www.mediafire.com/file/ne8efqc0wr5uyya/Raja_Gidh_by_Bano_Qudsia_-_kitabtribe.pk.pdf/file",
  "Price": "30"
},
{
  "_id": {
    "$oid": "659ae44ea9865502f7be2df4"
  },
  "bookTitle": "Aangan",
  "authorName": "Khadija Mastoor",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1404917886i/4108195.jpg",
  "category": "History",
  "bookDescription": "As of my last knowledge update in January 2022, \"Aangan\" is a novel written by Khadija Mastoor, a Pakistani author. The novel is set against the backdrop of the Indian subcontinent during the pre-partition era, providing a historical and cultural perspective.\n\nHere is a general description of the novel:\n\n\"Aangan,\" which translates to \"Courtyard\" in English, is a captivating narrative that unfolds in a joint family setting. The story revolves around the lives of the members of a Muslim family residing in the walled courtyard of a traditional South Asian household. The novel spans the tumultuous period leading up to the partition of India in 1947, a time marked by political upheaval and social change.\n\nThe characters in \"Aangan\" grapple with their personal struggles, relationships, and the larger socio-political forces shaping their destinies. The author skillfully weaves together the individual stories of various family members, providing a rich tapestry of emotions, traditions, and conflicts.\n\nThroughout the novel, readers are immersed in the cultural intricacies and historical events of the time, offering a nuanced understanding of the societal changes and challenges faced by the characters. As the political landscape evolves, so do the dynamics within the family, reflecting the broader transformations occurring in the region.",
  "bookPDFURL": "http://www.mediafire.com/file/q2ccaufagzdf9cp/Aangan+www.pakistanipoint.com.pdf",
  "Price": "50"
},
{
  "_id": {
    "$oid": "659c2116a9865502f7be2df5"
  },
  "bookTitle": "Alif",
  "authorName": "Umera Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1556412576i/45318288.jpg",
  "category": "Religion and spirituality",
  "bookDescription": "Alif is Umera Ahmed's latest novel\n\nThe story of encircles a hardworking and diligent filmmaker named Momin, who is shown to be tangled between his spirituality and the glamourous life that he leads.\n\nThe novel comes packed full of sentiments and love which surrounds family values and depicts the love of a dervish in the novel.",
  "bookPDFURL": "https://drive.google.com/file/d/13H5BkQr9IMnfHVdtJIssqEy8Nt73qOG0/view",
  "Price": "25"
},
{
  "_id": {
    "$oid": "659c231ba9865502f7be2df6"
  },
  "bookTitle": "Ham Kahan Ke Sachhe The",
  "authorName": "Umera Ahmad",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1465298602i/8518687.jpg",
  "category": "Fiction",
  "bookDescription": "Mishal is a beautiful girl. Everyone loves her. Brought up in an elite household with everything she can wish for, you think, she has everything she ever wants, but does she? On the other hand is Mishal's cousin Mehreen; a girl who is not-so-pretty and has a disturbing background. Everyone's annoyed by her bad behavior and ill-mannered ways. Living in the same house, these two girls go head-to-head. And in the middle of these two is caught Aswad, a handsome young guy, who is their cousin and who is also madly in love with Mishal, and hates Mehreen. All three of them think they have their lives perfectly planned out for themselves but can this much hate and competition really end up in something good?\nIn Hum Kahan Kay Sachay Thay (English: When Were We Ever Truthful), the extent to which the imperfections and flaws of parents haunt their offspring in an eastern society is highlighted. Children belonging to dysfunctional families are always judged in the shadow of their parents.\nIt is a collection of three stories; Hum Kahan Kay Sachay Thay, Band Kiwaron Ke Aagey and Halal-e-Jurrat.\nIt appeared in episodic form in Kiran digest from August 1998 to November 1998.",
  "bookPDFURL": "https://drive.google.com/file/d/1cHyHooKX2E-2B9V0zRIOCR_o8pKHQXm3/view",
  "Price": "20"
},
{
  "_id": {
    "$oid": "659c27daa9865502f7be2df7"
  },
  "bookTitle": "Parizaad",
  "authorName": "Hashim Nadeem",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1475507933i/23201735.jpg",
  "category": "Biography",
  "bookDescription": "Parizaad is an Urdu-language novel by Pakistani author Hashim Nadeem. The novel revolves around the titular protagonist who is always mocked due to his personality and name. The novel revolves around the titular protagonist who is always mocked due to his personality and name.",
  "bookPDFURL": "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&ved=2ahUKEwil8ufFns6DAxXKbvUHHcqYBR4QFnoECDMQAQ&url=https%3A%2F%2Farchive.org%2Fdownload%2FPardesiDarkht%2FParizad.pdf&usg=AOvVaw2SjN69MyHdzyNSlOkpDk72&opi=89978449",
  "Price": "30"
},
{
  "_id": {
    "$oid": "659c2937a9865502f7be2df8"
  },
  "bookTitle": "Amar Bail",
  "authorName": "Umera Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1464523820i/30312047.jpg",
  "category": "Novel",
  "bookDescription": "Amar Bail (English: Mistletoe) is a love story of Umar Jehangir and Aleezay Sikandar, set-up in the backdrop of Pakistani bureaucratic culture. It is a story of imbalanced relationships, broken families, lust for power, complexes, insecurities and amidst all problems of love, its intensity and sacrifices. It depicts the true face of our bureaucratic system, highlighting social evils like corruption, nepotism and injustice and how at times going against the law is the only way to punish the culprits. The novel touches your heart by its brilliant portrayal of human emotions and psychology.",
  "bookPDFURL": "https://drive.google.com/file/d/1is-Ngq-p_3qkzY1zH4es5_EP3oC6YS2O/view",
  "Price": "60"
},
{
  "_id": {
    "$oid": "659c2a59a9865502f7be2df9"
  },
  "bookTitle": "Halim",
  "authorName": "Nemrah Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1557851966i/35388036.jpg",
  "category": "Biography",
  "bookDescription": "The word Haalim is an Arabic word and it means “A Dreamer”. It’s a long novel with episodes and each episode will have a separate title, like Namal.\nThe book follows Taliyah Murad, a 28 year old scam artist living in Kaula Lampur, Malaysia. She's an ace at what she does and has big dreams, literally. Taliyah Murad is clairvoyant.",
  "bookPDFURL": "https://drive.google.com/file/d/1vCSnhmwTA4tHXOP3fDzjmHFVLSAlbLFa/view",
  "Price": "45"
},
{
  "_id": {
    "$oid": "659c2d49a9865502f7be2dfa"
  },
  "bookTitle": "Ishq e Aatish",
  "authorName": "Sadia Rajpoot",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1622078250i/58171223.jpg",
  "category": "Fiction",
  "bookDescription": "The book sketches the father-daughter relationship. How Maliha loses her life obeying her father against her love for Wajdan. Then, NoorulHuda and Wujdan develop close relationships with their children as parents. The novel portrays men's nature of losing hope when he didn't get what he has asked for.\n\nIshq Aatish is a story of two lovers who choose to burn in spite of societal resistances which is still considered a taboo to discuss in many parts of the world.",
  "bookPDFURL": "https://drive.google.com/file/d/1X5nhbzQU3jBGLVN_4GWoy5YDTXxYvu-R/view",
  "Price": "45"
},
{
  "_id": {
    "$oid": "65e69176363b80ba672e1204"
  },
  "bookTitle": "Humsafar",
  "authorName": "Farhat Ishtiaq",
  "imageURL": "https://upload.wikimedia.org/wikipedia/en/7/72/Humsafarnovel.png",
  "category": "Fiction",
  "bookDescription": "Humsafar is a romantic novel written by Farhat Ishtiaq. The novel was first published in 7 parts in Khawateen Digest monthly from July 2007 to January 2008. It was later published as a complete novel by Ilm-o-Irfan Publishers. The story revolves around Ashar and Khirad's relationship with their daughter, Hareem, and how she unknowingly bridges the distances that exist between her parents. The novel is written in a retrospective manner and told mostly in flashbacks. The first half of the novel is based on mostly Ashar’s reflections and his point of view while the second part of the novel is told mainly from Khirad’s point of view.\n\nThe story has been adapted into a drama serial (Humsafar), produced by Momina Duraid and directed by Sarmad Sultan Khoosat. The drama aired on Hum TV from September 2011 to February 2012.",
  "bookPDFURL": "https://download2390.mediafire.com/wfvf84dvfipgr5CFgGriZQbnvV489ecbBFl94zSMaDTRYi9h0UVqVf3mipL9mqajudBp4B4iKUAIEZbGppf0VrPbIJr7NZP1JB_YH6RuUOkcdm2ClLihpWT5yCpGw_u9Jt5Bfkk_pOQtTQxg3nIR80nlYp5XAAP0ORm9Hep-y6aA/i8olmf6iay48d5l/Humsafar+novel+complete+by+Farhat+Ishtiaq.pdf",
  "Price": "150"
},
{
  "_id": {
    "$oid": "65e692e6363b80ba672e1205"
  },
  "bookTitle": "Maala",
  "authorName": "Nemrah Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1638876935i/59769378.jpg",
  "category": "Fantasy",
  "bookDescription": "\"Maala\" is a captivating novel written by Neemrah Ahmed that delves into the complexities of human emotions and relationships. Set in a picturesque village nestled amidst lush greenery, the story follows the lives of its diverse inhabitants who are bound together by the threads of love, loss, and redemption.\n\nAt the heart of the narrative is Maala, a young woman whose resilience and determination to carve her own path in life serve as a beacon of hope for those around her. Through her eyes, readers are transported into a world filled with rich cultural traditions, familial ties, and societal norms.\n\nAs the plot unfolds, we witness Maala's journey of self-discovery and empowerment as she confronts the challenges and obstacles that threaten to derail her dreams. Along the way, she forges unexpected connections with individuals from different walks of life, each offering their own unique perspectives and insights.\n\nAhmed's masterful storytelling skillfully weaves together themes of love, sacrifice, and forgiveness, drawing readers into a mesmerizing tale that resonates long after the final page is turned. Through her nuanced character development and evocative prose, she invites readers to ponder the complexities of human nature and the enduring power of hope in the face of adversity.\n\n\"Maala\" is a compelling exploration of the human spirit and the bonds that unite us, making it a must-read for fans of contemporary fiction. With its vivid imagery and heartfelt portrayal of life's triumphs and tribulations, it is sure to leave a lasting impression on all who embark on this unforgettable literary journey.",
  "bookPDFURL": "https://drive.google.com/file/d/1dsej9O2wTUONlZG7zLEJpD0IcZLmM5V8/view?usp=share_link",
  "Price": "70"
},
{
  "_id": {
    "$oid": "65e6944f363b80ba672e1206"
  },
  "bookTitle": "Aks",
  "authorName": "Umera Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1379943077i/18529701.jpg",
  "category": "Romantic",
  "bookDescription": "In a game of chess, the queen is the most powerful piece, yet the whole game of chess is about the king’s show of power – his absolute success, where he captures the other king and declares check mate. Chirya, a young girl of 8 years old, is not quite satisfied with this arrangement. If the queen is the most powerful piece in chess, then surely she must be the most ‘important’ piece of chess, not the king, Chirya insists. And in the real life game of chess, Chirya is about to do just that – make the queen the most important player.\nAks (English: Reflection) is a story of struggle, of injustice, of childhood traumas and life’s crippling hurdles. It is a story of courage, of resilience, of not bowing down, and standing up each time you fall flat on your face.\nAks appeared in Pakeeza Digest from August 2011 to December 2012.",
  "bookPDFURL": "https://drive.google.com/file/d/1SgqymZEveafJX8SuiUaSuvrsCTIrvWJB/view",
  "Price": "90"
},
{
  "_id": {
    "$oid": "65e69506363b80ba672e1207"
  },
  "bookTitle": "Karakoram Ka Taj Mahal ",
  "authorName": "Nemrah Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1591179508i/18875582.jpg",
  "category": "Romantic",
  "bookDescription": "\"Karakoram Ka Taj Mahal\" is a novel written by Nemrah Ahmed, a renowned Pakistani author known for her gripping storytelling and intricate plots. The title translates to \"The Taj Mahal of Karakoram,\" suggesting a grand and majestic setting for the story.\n\nThe novel likely revolves around the Karakoram mountain range, a breathtakingly beautiful and rugged region in Pakistan, known for its towering peaks and stunning landscapes. The comparison to the Taj Mahal, one of the world's most iconic monuments, hints at themes of beauty, love, and perhaps even tragedy.\n\nNemrah Ahmed's novels often feature strong character development and intricate relationships, set against the backdrop of Pakistan's diverse cultural landscape. Her writing style is known for its vivid descriptions and ability to transport readers to the settings she creates.\n\nIn \"Karakoram Ka Taj Mahal,\" readers can expect to be immersed in a tale that combines romance, adventure, and possibly elements of mystery or suspense. As with Ahmed's other works, the novel is likely to explore themes of love, sacrifice, and the human experience against the backdrop of a captivating setting.",
  "bookPDFURL": "https://drive.google.com/file/d/1UfKvRR_llzqYZt31OsG2OLw1714FSk9X/view?usp=drive_open",
  "Price": "100"
},
{
  "_id": {
    "$oid": "65e6a045aef05bbfda79f5f0"
  },
  "bookTitle": "La Hasil",
  "authorName": "Umera Ahmed",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1464448991i/9484900.jpg",
  "category": "Fiction",
  "bookDescription": "La Hasil is a sublime tale of who faced different trials in life. Driven by desire, belief, pride and prejudice, they run their lives according to their views. Khadija Noor, the centre stage character is the epitome of belief, patience and self-sacrifice. Mazhar, a seemingly practicing Muslim, is a self proclaimed caretaker of Islam. Marium, another main character, is desire personified. Catherine is a British girl, whose Pakistani father betrayed her mother, Ruth. This left irreparable scars on their lives.\nIt’s a story of redemption of someone and regrets of someone else. It’s a story of bringing out yourself from filth and then walking on the path of self-rectification & self-righteousness. It’s a story that tells when someone finds the light by the Grace of Almighty then nothing else matters anymore.\nLa Hasil was first published in Khawateen Digest from September 2001 to December 2001.",
  "bookPDFURL": "https://drive.google.com/file/d/1ukWU1586n7_ioTusPXFoue0qk7SPVLvK/view",
  "Price": "40"
},
{
  "_id": {
    "$oid": "65e6a218aef05bbfda79f5f1"
  },
  "bookTitle": "Abdullah",
  "authorName": "Hashim Nadeem",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1256929153i/7073167.jpg",
  "category": "Fiction",
  "bookDescription": "\"Abdullah\" is a compelling novel penned by the renowned Pakistani writer Hashim Nadeem. The story revolves around the character, Abdullah, a young boy who embarks on a journey of self-discovery and enlightenment. Set against the backdrop of the scenic Swat Valley in Pakistan, the novel takes readers on a captivating journey through the trials and tribulations faced by Abdullah as he navigates the complexities of life.Nadeem's masterful storytelling weaves together themes of love, sacrifice, and the pursuit of one's dreams. Through Abdullah's experiences, readers are offered profound insights into the human condition and the universal quest for meaning and fulfillment. The novel's richly drawn characters, vivid descriptions, and evocative imagery serve to immerse readers in the beauty and challenges of life in the Swat Valley. As Abdullah encounters various characters and experiences, he undergoes a transformative journey that ultimately leads him to a deeper understanding of himself and the world around him. With its poignant narrative and thought-provoking themes, \"Abdullah\" is a literary masterpiece that resonates with readers long after they have turned the final page. Hashim Nadeem's exploration of the human spirit and the search for identity makes \"Abdullah\" a timeless and unforgettable novel.",
  "bookPDFURL": "https://drive.google.com/uc?export=download&id=1PxKIvBOo5s-gMUcE7a2ZXfGTdAOTGOwH",
  "Price": "30"
},
{
  "_id": {
    "$oid": "65e6b2bcaef05bbfda79f5f3"
  },
  "bookTitle": "The Forty Rules of Love",
  "authorName": "Elif Shafak",
  "imageURL": "https://static-01.daraz.pk/p/785e28bce469ca2d7082d9483edf1ae5.jpg",
  "category": "Religion and spirituality",
  "bookDescription": "Ella Rubenstein is forty years old and unhappily married when she takes a job as a reader for a literary agent. Her first assignment is to read and report on Sweet Blasphemy, a novel written by a man named Aziz Zahara. Ella is mesmerized by his tale of Shams's search for Rumi and the dervish's role in transforming the successful but unhappy cleric into a committed mystic, passionate poet, and advocate of love. She is also taken with Shams's lessons, or rules, that offer insight into an ancient philosophy based on the unity of all people and religions, and the presence of love in each and every one of us. As she reads on, she realizes that Rumi's story mir­rors her own and that Zahara—like Shams—has come to set her free.\n\nIn this lyrical, exuberant follow-up to her 2007 novel, The Bastard of Istanbul, acclaimed Turkish author Elif Shafak unfolds two tantalizing parallel narratives—one contemporary and the other set in the thirteenth century, when Rumi encountered his spiritual mentor, the whirling dervish known as Shams of Tabriz—that together incarnate the poet's timeless message of love.",
  "bookPDFURL": "https://chagharzai.files.wordpress.com/2018/10/in_urdu-the_forty_rules_of_love_by_elif_shafak.pdf",
  "Price": "60"
},
{
  "_id": {
    "$oid": "65e6b6c7aef05bbfda79f5f4"
  },
  "bookTitle": "Adawat",
  "authorName": "Riaz Aqib Kohlar",
  "imageURL": "https://i.pinimg.com/474x/e5/af/10/e5af10cec1c95429134022d2d95c8301.jpg",
  "category": "Self-help",
  "bookDescription": "\"Adawat\" is a gripping novel penned by Riaz Aqib Kohlar, a talented Pakistani author known for his skillful storytelling and ability to captivate readers with his narratives. The title \"Adawat\" translates to \"enmity\" or \"hatred\" in English, suggesting that the novel may delve into themes of conflict, revenge, and the complexities of human relationships. Set against the backdrop of contemporary Pakistani society, \"Adawat\" likely explores the intricacies of interpersonal dynamics and the consequences of unresolved grievances. Kohlar's writing style is characterized by its vivid descriptions, realistic dialogue, and well-developed characters, all of which serve to draw readers into the world he creates.\n\nThe plot of \"Adawat\" may center around a protagonist who finds themselves entangled in a web of animosity and intrigue, as they navigate the challenges of confronting past grievances and seeking justice or redemption. Along the way, the novel may delve into themes of forgiveness, redemption, and the human capacity for both love and hate.\n\nKohlar's storytelling is known for its ability to evoke a range of emotions in readers, from suspense and tension to empathy and compassion. With \"Adawat,\" readers can expect to be taken on a compelling journey filled with twists and turns, as they unravel the mysteries and conflicts that lie at the heart of the story.\n\nOverall, \"Adawat\" promises to be a thought-provoking and engrossing read, exploring timeless themes of love, loss, and the complexities of the human psyche against the backdrop of contemporary Pakistani society.",
  "bookPDFURL": "https://drive.google.com/uc?export=download&id=12bK5JyOKuECd6EJqUZCghwhm9NcZ3zYG",
  "Price": "35"
},
{
  "_id": {
    "$oid": "65e6b83baef05bbfda79f5f5"
  },
  "bookTitle": "\tMera Sitamgar",
  "authorName": "Areej Shah",
  "imageURL": "https://play-lh.googleusercontent.com/y2Bz1FuFnGwc9PCEqifiEcwHn-PGAefGwALldbPcOUH05wg6vIluFVDTg3Ykxudwp0I=w526-h296-rw",
  "category": "Fiction",
  "bookDescription": "\"Mera Sitamgar\" is a captivating novel written by Areej Shah, a talented Pakistani author known for her poignant storytelling and vivid characterizations. The title \"Mera Sitamgar\" translates to \"My Tormentor\" in English, hinting at themes of betrayal, heartbreak, and the tumultuous nature of human relationships.\n\nSet against the backdrop of modern-day Pakistan, the novel likely follows the journey of its protagonist as they navigate the complexities of love and loss. Shah's writing is characterized by its emotional depth, realistic portrayals, and intricate plot twists, all of which serve to keep readers engaged from start to finish.\n\nThe plot of \"Mera Sitamgar\" may revolve around a central romance or relationship that is tested by external challenges or internal conflicts. As the story unfolds, readers are likely to be drawn into a web of secrets, lies, and misunderstandings, as the characters grapple with their own desires and the consequences of their actions.\n\nShah's ability to create multi-dimensional characters allows readers to empathize with their struggles and root for their redemption. Whether it's the protagonist grappling with past traumas or the antagonist wrestling with their own demons, each character is portrayed with depth and nuance, adding layers of complexity to the narrative.\n\nWith its evocative storytelling and exploration of universal themes such as love, betrayal, and forgiveness, \"Mera Sitamgar\" promises to be a gripping and emotionally resonant read. Areej Shah's skillful prose and compelling storytelling make \"Mera Sitamgar\" a novel that is sure to leave a lasting impression on readers long after they have turned the final page.",
  "bookPDFURL": "https://drive.google.com/file/d/1AIOnyfrFoTH71urm4VHeneRelMpY_LB8/view?usp=sharing",
  "Price": "30"
},
{
  "_id": {
    "$oid": "65e6c065aef05bbfda79f5f7"
  },
  "bookTitle": "Umrao Jan Ada",
  "authorName": "Mirza Mohammad Hadi Ruswa",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1334739432i/6056360.jpg",
  "category": "Biography",
  "bookDescription": "\"Umrao Jan Ada\" is a timeless Urdu novel written by Mirza Mohammad Hadi Ruswa, originally published in 1899. Set in the cultural milieu of 19th-century Lucknow, India, the novel is a classic of Urdu literature and is considered one of the greatest works of its genre.\n\nThe novel is a fictionalized account of the life of Umrao Jan, a renowned courtesan and poetess, whose journey takes her from a young girl named Amiran to the celebrated and respected Umrao Jan Ada. Through Umrao Jan's eyes, readers are transported to the opulent world of Lucknow's courtesan culture, with its intricate social hierarchies, rich traditions, and complex relationships.\n\nRuswa's writing is characterized by its lyrical prose, evocative descriptions, and deep insight into the human psyche. The novel delves into themes of love, loss, betrayal, and the struggle for identity in a society bound by tradition and societal norms.\n\nAs Umrao Jan navigates the challenges of her life, from her early upbringing in a village to her eventual rise to fame as a courtesan, readers are drawn into a world of passion, intrigue, and tragedy. Through her encounters with various characters, including the dashing nobleman Nawab Sultan, the kind-hearted poet Gauhar Mirza, and the enigmatic Faiz Ali, Umrao Jan's story unfolds with all the twists and turns of a classic tale.\n\n\"Umrao Jan Ada\" is not only a beautifully written novel but also a poignant exploration of the human condition and the universal quest for love and acceptance. Ruswa's masterpiece continues to captivate readers with its timeless themes and unforgettable characters, cementing its place as a literary treasure in Urdu literature.",
  "bookPDFURL": "https://bit.ly/3ofna5z",
  "Price": "45"
},
{
  "_id": {
    "$oid": "65e6c138aef05bbfda79f5f8"
  },
  "bookTitle": " Nadaar Log",
  "authorName": "Abdullah Hussein",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1318718132i/6365973.jpg",
  "category": "Memoir",
  "bookDescription": "Published first in 1996 this novel by Abdullah Hussain is considered as a sequel to his famous Udaas Naslain. The story of this novel takes place during 1897 to 1974. This is the story of a generation that has no urge to protect and fight for its rights, people who have accepted everything as fate and have left themselves to the flow of time. The story really gets a takeoff after 1947 when Pakistan gets independence and the people who fought for certain ideals are pushed to wall by those who happen to be in corridors of power. The novel describes those years of indifference, difficulties and turbulence which first germinate the seeds of undemocratic governments and then it leads to secession of the country in 1971. The novel suggests that this was the period where if truth was upheld the history and the geography of Pakistan would have been different but since people kept silence which tantamount to a sin, so they have to reap the wages of this in shape of disintegrating the federation and losing their brothers. Nadar Loog is the story of a people who had great ideals but were found wanting in action when it mattered to stand and assert. This is the story about poverty of action and deeds that leads a nation and people to a state of flux.",
  "bookPDFURL": "https://drive.usercontent.google.com/download?id=10CQUWbgDtgr5Tmzm71m22tglCoUsTR7d&export=download&authuser=0",
  "Price": "90"
},
{
  "_id": {
    "$oid": "65e6c22aaef05bbfda79f5f9"
  },
  "bookTitle": "God's Own Land",
  "authorName": "Shaukat Siddiqui",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1322393731i/823810.jpg",
  "category": "Fiction",
  "bookDescription": "Recently serialised on Pakistan television, God's Own Land is set in the slums of Karachi and Lahore. It is the early 1950s, shortly after partition with India.\nThe story concerns a poor but respectable Pakistani family which has fallen on hard times. Corruption and degradation take over their lives. Jobless, and without any real hope of a better life, they find themselves in the clutches of unprincipled entrepreneurs who exploit each of them - totally. The tragic, but deeply moving finale, is inevitable.\nThe author, Shaukat Siddiqi, is considered one of the most talented of modern Urdu writers. The translator, David J. Matthews, points out that for those who know Pakistan they will realise that little has changed in the last forty\n'The bright lights of Karachi and Lahore, the smart shops and hotels mask the fact that so many of our fellow human beings are still dying of hunger through no fault of their own. It might be ascribed to the will of Allah, to fate or destiny, but suffering is normal in the course of life.'",
  "bookPDFURL": "https://bit.ly/38dhpzr",
  "Price": "20"
},
{
  "_id": {
    "$oid": "65e6c342aef05bbfda79f5fa"
  },
  "bookTitle": "Basti ",
  "authorName": "Intizar Husain",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1477479591i/17238107.jpg",
  "category": "History",
  "bookDescription": "Basti is the great Pakistani novel, a beautifully written, brilliantly inventive reckoning with the violent history of a country whose turbulence, ambitions, and uncertainties increasingly concern the whole world. In Urdu, basti means any space, from the most intimate to the most universal, in which groups of people come together to try to live together, and the universal question at the heart of the book is how to constitute a common world. What brings people together? What tears them apart? “When the world was still all new, when the sky was fresh and the earth not yet soiled, when trees breathed through centuries and ages spoke around in the voices of birds, how astonished he was that everything was so new and yet looked so old”—so the book begins, with a mythic, even mystic, vision of harmony, as the hero, Zakir, looks back on his childhood in a subcontinent that had not yet been divided between Muslims and Hindus. But Zakir is abruptly evicted from this paradise—real or imagined—into the maelstrom of history. The new country of Pakistan is born, separating him once and for all from the woman he loves, and in a jagged and jarring sequence of scenes we witness a nation and a psyche torn into existence only to be torn apart again and again by political, religious, economic, linguistic, personal, and sexual conflicts—in effect, a world of loneliness. Zakir, whose name means “remember,” serves as the historian of this troubled place, while the ties he maintains across the years with old friends—friends who run into one another in cafés and on corners and the odd other places where history takes a time-out—suggest that the possibility of reconciliation is not simply a dream. The characters wait for a sign that minds and hearts may still meet. In the meantime, the dazzling artistry of Basti itself gives us reason to hope against hope.",
  "bookPDFURL": "https://drive.google.com/file/d/1T6VSItxBX893uSqnj1j8IydFvqAD8DSV/view",
  "Price": "50"
},
{
  "_id": {
    "$oid": "65e6c3f6aef05bbfda79f5fb"
  },
  "bookTitle": "Dastak Na Do",
  "authorName": "Altaf Fatima",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1401075788i/16204804.jpg",
  "category": "Self-help",
  "bookDescription": "\"Dastak Na Do\" is a celebrated Urdu novel penned by Altaf Fatima, a prominent Pakistani writer known for her insightful portrayal of human emotions and societal issues. The title \"Dastak Na Do\" translates to \"Do Not Knock\" in English, hinting at themes of privacy, solitude, and the desire for introspection.\n\nSet against the backdrop of post-partition Pakistan, the novel offers a poignant exploration of the lives of its characters as they grapple with the challenges of displacement, identity, and belonging. Altaf Fatima's writing is characterized by its lyrical prose, nuanced characterizations, and profound observations about the human condition.\n\nThe plot of \"Dastak Na Do\" may revolve around a central protagonist or a group of characters whose lives intersect in unexpected ways. As the story unfolds, readers are likely to be drawn into a world of complex relationships, buried secrets, and unspoken desires.\n\nFatima's ability to evoke a sense of time and place allows readers to immerse themselves fully in the setting of the novel, whether it's the bustling streets of Lahore or the tranquil countryside of Punjab. Through vivid descriptions and vivid imagery, the author paints a vivid picture of post-independence Pakistan and the challenges faced by its inhabitants.\n\nWith its thought-provoking themes and evocative storytelling, \"Dastak Na Do\" is a novel that resonates with readers long after they have turned the final page. Altaf Fatima's exploration of the human psyche and the quest for identity makes \"Dastak Na Do\" a timeless masterpiece of Urdu literature.",
  "bookPDFURL": "http://www.mediafire.com/file/1upnejag5qjxxvw/Dastak+Na+Do+By+Altaf+Fatima.zip",
  "Price": "25"
},
{
  "_id": {
    "$oid": "65e6c50baef05bbfda79f5fc"
  },
  "bookTitle": "Ghulam Bagh",
  "authorName": "Mirza Athar Baig",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1370022327i/18002038.jpg",
  "category": "Philosophy",
  "bookDescription": "\"Ghulam Bagh\" is a captivating novel written by Mirza Athar Baig, a talented Pakistani author known for his unique narrative style and thought-provoking themes. The title \"Ghulam Bagh\" translates to \"The Slave's Garden\" in English, suggesting a story that explores the themes of captivity, freedom, and the human condition.\n\nSet in contemporary Pakistan, the novel offers a compelling glimpse into the lives of its characters as they navigate the complexities of love, power, and identity. Baig's writing is characterized by its vivid imagery, rich symbolism, and intricate plot twists, all of which serve to captivate readers from start to finish.\n\nThe plot of \"Ghulam Bagh\" likely revolves around a central protagonist or a group of characters whose lives become intertwined in unexpected ways. As the story unfolds, readers are drawn into a world of hidden desires, buried secrets, and moral ambiguity.\n\nBaig's ability to create multi-dimensional characters allows readers to empathize with their struggles and understand their motivations. Whether it's the protagonist grappling with their own demons or the antagonist driven by ambition and greed, each character is portrayed with depth and nuance, adding layers of complexity to the narrative.\n\nWith its evocative storytelling and exploration of universal themes such as love, power, and redemption, \"Ghulam Bagh\" promises to be a compelling read. Mirza Athar Baig's skillful prose and thought-provoking narrative make \"Ghulam Bagh\" a novel that is sure to resonate with readers, leaving them eagerly awaiting his next literary offering.",
  "bookPDFURL": "https://archive.org/download/1_20200125_20200125_1620/%D8%BA%D9%84%D8%A7%D9%85%20%D8%A8%D8%A7%D8%BA%D8%8C%20%D9%85%D8%B1%D8%B2%D8%A7%20%D8%A7%D8%B7%DB%81%D8%B1%20%D8%A8%DB%8C%DA%AF%281%29.pdf",
  "Price": "55"
},
{
  "_id": {
    "$oid": "65e6c684aef05bbfda79f5fd"
  },
  "bookTitle": "Delhi: A Novel",
  "authorName": "Khushwant Singh ,  Irfan Ahmad Khan  (Translator)",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1475509838i/32357016.jpg",
  "category": "Historical",
  "bookDescription": "\"Delhi: A Novel\" is a captivating literary masterpiece penned by the acclaimed Indian author, Khushwant Singh. The novel serves as a poignant tribute to the vibrant city of Delhi, tracing its tumultuous history and rich cultural heritage through the lives of its diverse inhabitants.\n\nSet against the backdrop of Delhi's ancient streets, bustling bazaars, and majestic monuments, the novel immerses readers in the city's dynamic atmosphere and multifaceted character. Singh's evocative prose vividly brings to life the sights, sounds, and smells of Delhi, capturing its essence with remarkable detail and authenticity.\n\nAt its heart, \"Delhi: A Novel\" is a mosaic of interconnected stories, spanning centuries and encompassing a wide range of characters from different walks of life. From emperors and nobles to merchants and artisans, each character contributes to the tapestry of Delhi's history, reflecting the city's diversity and complexity.\n\nThrough the lens of these characters, Singh explores the themes of power, love, betrayal, and redemption, offering readers a profound insight into the human experience. Whether it's the grandeur of Mughal courts, the intrigue of colonial-era politics, or the struggles of modern-day Delhiites, the novel paints a rich and nuanced portrait of Delhi's past and present.\n\n\"Delhi: A Novel\" is not only a gripping work of fiction but also a compelling meditation on the enduring spirit of a city that has stood as a symbol of resilience and vitality throughout the ages. With its lyrical prose and profound storytelling, Khushwant Singh's masterpiece continues to captivate readers, inviting them to discover the timeless beauty and complexity of Delhi.",
  "bookPDFURL": "https://drive.google.com/uc?export=download&id=1nHbWXg0FfNS4oNne156xin-tQ2ZwXSYu",
  "Price": "75"
},
{
  "_id": {
    "$oid": "65e6c786aef05bbfda79f5fe"
  },
  "bookTitle": "Gao Daan",
  "authorName": "Munshi Premchand",
  "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1464610789i/30318394.jpg",
  "category": "Poetry",
  "bookDescription": "\"Godaan\" is a classic Hindi novel written by the renowned Indian author Munshi Premchand. Set in the backdrop of rural India during the early 20th century, \"Godaan\" is considered one of Premchand's most celebrated works and a masterpiece of Indian literature.\n\nThe novel follows the life of Hori, a poor peasant farmer, and his family as they struggle to make ends meet in the village of Oudh. Hori dreams of owning a cow, which he believes will bring prosperity to his household. However, despite his relentless efforts and sacrifices, Hori finds himself unable to afford one.\n\nAs the story unfolds, \"Godaan\" delves into the various social, economic, and political issues prevalent in rural India at the time. Premchand skillfully portrays the harsh realities faced by peasants like Hori, including oppressive landlords, crippling debts, and social injustice.\n\nThrough its vivid characters and compelling narrative, \"Godaan\" offers a poignant commentary on the complexities of human relationships, the struggles of the working class, and the impact of colonialism on Indian society. Premchand's writing is characterized by its deep empathy for his characters and his ability to depict their joys, sorrows, and aspirations with profound insight and sensitivity.\n\n\"Godaan\" is not only a powerful social commentary but also a timeless story of hope, resilience, and the enduring human spirit. Its exploration of themes such as poverty, morality, and the caste system continues to resonate with readers across generations, cementing its status as a literary classic in Indian literature.",
  "bookPDFURL": "https://www.mediafire.com/view/c747d6u2sr76064/Gao_Dan_by_Munshi_Prem_Chand.pdf",
  "Price": "15"
},
{
  "_id": {
    "$oid": "65e6c99caef05bbfda79f5ff"
  },
  "bookTitle": "Dasht E Wehshat",
  "authorName": "Mehwish Ali",
  "imageURL": "https://i0.wp.com/novelscorner.com/wp-content/uploads/2022/09/Dasht-E-Wehshat-Novel-by-Mehwish-Ali.jpg?fit=540%2C861&ssl=1",
  "category": "Love",
  "bookDescription": "Dasht E Wehshat by Mehwish Ali is a romantic urdu novel. Like other novels, Mehwish has shown a romantic story in this novel. The main characters of this novel are Hoor Ul Ain, Inspector Arman, Noor Ul Ain, SP Burhan Alvi, Samiya, Muskan, Daad Burhan, Fitna, and Waqar Baloch. The novel shows the love bond of Noor ul Ain and Burhan. The other story belongs to Hoor Ul Ain and Saeed Alam.",
  "bookPDFURL": "https://www.mediafire.com/file/n0sa80veg753su0/Dasht_E_Wehshat_by_Mehwish_Ali.pdf/file",
  "Price": "65"
},
{
  "_id": {
    "$oid": "65e6cabdaef05bbfda79f600"
  },
  "bookTitle": "Taseer e Qurbat",
  "authorName": "Suneha Rauf",
  "imageURL": "https://i.pinimg.com/474x/c3/59/14/c35914d1453ee914c6273428484ff2c3.jpg",
  "category": "Fiction",
  "bookDescription": "\"Taseer-e-Qurbat\" is a captivating novel written by Suneha Rauf, a talented Pakistani author known for her compelling storytelling and vivid characterizations. The title \"Taseer-e-Qurbat\" translates to \"The Impact of Closeness\" in English, suggesting a narrative that explores the profound effects of relationships and emotional bonds.\n\nSet against the backdrop of contemporary Pakistani society, the novel likely delves into the lives of its characters as they navigate the complexities of love, friendship, and family dynamics. Rauf's writing style is characterized by its emotional depth, realistic portrayals, and intricate plot development, all of which serve to draw readers into the story.\n\nThe plot of \"Taseer-e-Qurbat\" may revolve around a central protagonist or a group of characters whose lives become intertwined in unexpected ways. As the story unfolds, readers are likely to be immersed in a world of passion, conflict, and personal growth, as the characters grapple with their own desires, fears, and aspirations.\n\nRauf's ability to create relatable characters and authentic relationships allows readers to empathize with their struggles and celebrate their triumphs. Whether it's the protagonist navigating the complexities of romance or supporting characters facing their own challenges, each character is portrayed with depth and nuance, adding layers of complexity to the narrative.\n\nWith its evocative storytelling and exploration of universal themes such as love, loss, and redemption, \"Taseer-e-Qurbat\" promises to be a compelling read. Suneha Rauf's skillful prose and insightful exploration of human emotions make \"Taseer-e-Qurbat\" a novel that is sure to resonate with readers, leaving them eagerly awaiting her next literary offering.",
  "bookPDFURL": "https://www.mediafire.com/file/2uu1lxemaiiuk8y/Taseer_E_Qurbat_Novel_By_Suneha_Rauf_All_Episode.pdf/file",
  "Price": "35"
},
{
  "_id": {
    "$oid": "65e6cedeaef05bbfda79f601"
  },
  "bookTitle": "Shiddat E Ishq",
  "authorName": "Mirha Shah",
  "imageURL": "https://i.pinimg.com/474x/18/29/86/182986427bacaae3297766ed78621c04.jpg",
  "category": "Love",
  "bookDescription": "\"Shiddat E Ishq\" is a captivating novel penned by Mirha Shah, a talented Pakistani author known for her engaging storytelling and deep exploration of human emotions. The title \"Shiddat E Ishq\" translates to \"Intensity of Love\" in English, hinting at the central theme of passionate and profound emotions that drive the narrative.\n\nSet against the backdrop of contemporary Pakistani society, the novel likely delves into the lives of its characters as they navigate the complexities of love, longing, and heartbreak. Mirha Shah's writing style is characterized by its evocative prose, realistic portrayals, and intricate plot development, all of which contribute to a deeply immersive reading experience.\n\nThe plot of \"Shiddat E Ishq\" may revolve around a central romance or relationship, which serves as the driving force behind the narrative. As the story unfolds, readers are likely to be drawn into a world of intense emotions, as the characters grapple with their desires, insecurities, and the consequences of their actions.\n\nShah's ability to create multi-dimensional characters allows readers to empathize with their struggles and understand their motivations. Whether it's the protagonist navigating the complexities of love or supporting characters dealing with their own challenges, each character is portrayed with depth and nuance, adding layers of complexity to the narrative.\n\nWith its exploration of universal themes such as love, sacrifice, and redemption, \"Shiddat E Ishq\" promises to be a compelling read. Mirha Shah's skillful storytelling and insightful exploration of human relationships make \"Shiddat E Ishq\" a novel that is sure to resonate with readers, leaving them eagerly anticipating her future literary endeavors.",
  "bookPDFURL": "https://www.mediafire.com/file/m6p4gsy4mroqww1/Shiddat_e_ishq_by_Mirha_Shah.pdf/file",
  "Price": "20"
},
{
  "_id": {
    "$oid": "65e6d13caef05bbfda79f602"
  },
  "bookTitle": "Black Moon",
  "authorName": "Nisha Umar",
  "imageURL": "https://farm66.staticflickr.com/65535/53466948657_ef766bc7e3_b.jpg",
  "category": "Self-help",
  "bookDescription": "\"Black Moon\" is a compelling novel written by Nisha Umar, a talented Pakistani author known for her gripping storytelling and vivid characterizations. The title \"Black Moon\" suggests a story imbued with darkness and mystery, hinting at themes of suspense, intrigue, and perhaps even the supernatural.\n\nSet against the backdrop of contemporary Pakistan or an imagined world, the novel likely follows the journey of its characters as they navigate a series of unexpected events and challenges. Umar's writing style is characterized by its evocative prose, intricate plot twists, and well-developed characters, all of which serve to keep readers engaged from start to finish.\n\nThe plot of \"Black Moon\" may revolve around a central mystery or conflict that propels the narrative forward. As the story unfolds, readers are likely to be drawn into a world of secrets, betrayal, and danger, as the characters grapple with their own desires, fears, and vulnerabilities.\n\nUmar's ability to create multi-dimensional characters allows readers to empathize with their struggles and understand their motivations. Whether it's the protagonist facing a personal crisis or supporting characters grappling with their own demons, each character is portrayed with depth and nuance, adding layers of complexity to the narrative.\n\nWith its evocative storytelling and exploration of universal themes such as love, loss, and redemption, \"Black Moon\" promises to be a captivating read. Nisha Umar's skillful prose and compelling narrative make \"Black Moon\" a novel that is sure to leave a lasting impression on readers, leaving them eagerly anticipating her future literary endeavors.",
  "bookPDFURL": "https://drive.google.com/u/0/uc?id=1FLCcY9tECYRAhkvL7Df8GX4Egkke2CUr&export=download",
  "Price": "20"
},
{
  "_id": {
    "$oid": "65e6d307aef05bbfda79f603"
  },
  "bookTitle": "Aira",
  "authorName": "Aneeta Raja",
  "imageURL": "https://kitabnagri.xyz/wp-content/uploads/2024/02/Aira-Complete-Novel-By-Aneeta-Raja.jpg",
  "category": "Self-help",
  "bookDescription": "**Aira** by Aneeta Raja is a captivating novel that delves into the complexities of identity, family, and belonging. Aira, a young Indian-American woman, embarks on a journey of self-discovery after her father's sudden death. Raised in a traditional Indian household, she has always felt a disconnect between her true self and the expectations placed upon her.\n\nAs she navigates the aftermath of her loss, Aira encounters a diverse cast of characters who challenge her preconceptions and push her to confront her own beliefs. Through conversations with her estranged mother, a charismatic artist, and a wise old woman, she begins to unravel the secrets of her family's past and the true nature of her identity.\n\nRaja's prose is lyrical and evocative, capturing the vibrant colors and rich tapestry of Indian culture. She weaves together elements of mythology, tradition, and contemporary life, creating a world that is both familiar and deeply resonant.\n\nAira's journey is a poignant exploration of the challenges faced by those who navigate multiple worlds. She grapples with the weight of her heritage while also embracing the freedom to forge her own path. Through her struggles and triumphs, Aira ultimately finds her voice and a sense of belonging that transcends cultural boundaries.\n\n**Aira** is a thought-provoking and emotionally resonant novel that celebrates the beauty and complexity of the human experience. It is a story that will stay with readers long after they turn the final page.",
  "bookPDFURL": "https://www.mediafire.com/file/dyzq2sv01ptgk10/Aira_Novel_By_Aneeta_Raja_Complete_PDF.pdf/file",
  "Price": "25"
},
{
  "_id": {
    "$oid": "65e6d4c1aef05bbfda79f604"
  },
  "bookTitle": "Aks E Man",
  "authorName": "Rabia Zeeshan",
  "imageURL": "https://kitabnagri.org/wp-content/uploads/2024/03/Aks-E-Man-Novel.webp",
  "category": "Fiction",
  "bookDescription": "**Aks E Man** by Rabia Zeeshan is a poignant and immersive novel that delves into the intricate tapestry of human emotions, exploring the profound impact of love, loss, and the quest for redemption.\n\nSet against the vibrant backdrop of Lahore, Pakistan, the story follows Faiza, a young woman whose life is shattered by the tragic loss of her husband. As she navigates the depths of grief and despair, she encounters Hamza, a mysterious stranger who offers her a glimmer of hope amidst the darkness.\n\nTogether, Faiza and Hamza embark on a journey of healing and self-discovery. They share their vulnerabilities, confront their pasts, and find solace in each other's company. However, their newfound connection is tested by societal expectations, family obligations, and the lingering shadows of their past relationships.\n\nThrough vivid prose and evocative storytelling, Aks E Man explores the transformative power of love and its ability to heal even the deepest wounds. It delves into themes of grief, resilience, the search for meaning, and the enduring nature of human connection.\n\nWith its intricate characters, thought-provoking themes, and immersive setting, Aks E Man is a mesmerizing novel that will resonate with readers long after they turn the final page. It is a testament to the indomitable spirit of the human heart and the transformative power of love and redemption.",
  "bookPDFURL": "https://www.mediafire.com/file/69yg0jq7gl12ji6/Aks_E_Man_By_Rabia_Zeeshan_%2528Season_2_OF_Intekhab_E_Maan%2529_Episode_1_%2526_39.pdf/file",
  "Price": "35"
},
{
  "_id": {
    "$oid": "65e6d767aef05bbfda79f605"
  },
  "bookTitle": "Yaqeen E Kamil",
  "authorName": "Bint E Nazeer",
  "imageURL": "https://kitabnagri.xyz/wp-content/uploads/2023/03/Yaqeen-E-Kamil-novel-cover-2.jpg",
  "category": "Novel",
  "bookDescription": "Yaqeen E Kamil E Man by Bint E Nazeer is a thought-provoking and poignant Urdu novel that explores the complexities of love, faith, and societal expectations.\n\nSet against the backdrop of early 20th century India, the novel follows the lives of two young women, Aamina and Safiya. Aamina is a devout and pious woman who finds solace in her unwavering faith and submission to God's will. Safiya, on the other hand, is a strong-willed and independent woman who questions traditional norms and seeks fulfillment beyond the confines of society.\n\nAs their paths intertwine, Aamina and Safiya's contrasting worldviews clash, leading to a profound exploration of the nature of belief, love, and personal agency. The novel delves into themes of religious extremism, female empowerment, and the search for true happiness.\n\nThrough vivid prose and relatable characters, Yaqeen E Kamil E Man offers a nuanced portrayal of the challenges faced by women in a patriarchal society. It questions the boundaries of faith and tradition, and encourages readers to reflect on the nature of true belief and the importance of personal choice.\n\nWith its timeless themes and thought-provoking narrative, Yaqeen E Kamil E Man remains a beloved and influential work of Urdu literature, resonating with readers across generations.",
  "bookPDFURL": "https://drive.google.com/file/d/1lvNAuiQZXuBK8o0JghN5VBBWTxmHAfXD/view",
  "Price": "45"
}]